# print("Hello World!")
# print("I lesson python for automation testing")
# print("Привет 'друзья люди")
#
# # ТИПЫ ДАННЫХ
# int - целые числа (5, 10, 200)
# float - числа с плавающей точкой (5.5, 10.4)
# str - строковые данные ("Hello", 'Привет')
# boolean - логические (true, false)

# ПЕРЕМЕННЫЕ
# Название переменных начинается либо с буквы 'var' или с нижнего подчеркивания '_var'
# Переменные называеются всегда с маленькой буквы - 'varSal'
# Имя переменной не должно содержать пробелов или спец символов
# Переменная из нескольких слов разделяется нижним подчеркиванием - 'first_name'
# Имя переменной не должно быть похоже на ключевое слово языка

num_1 = 2
num_2 = 5
result = num_1 + num_2
print(result)

# Как узнать тип данных?
# Можно воспользоваться функцией type()
print(type(num_1))


