# Python создан в 1991 году
# Python - интерпретируемый язык, код выполняется последовательно.
# Интерпретатор - программа, выполняющая пошаговую обработку исходного кода, его анализ
# и техническую реализацию этой же части кода

print("Hello world!")
# есть встроенные стандартные функции в python

a = 10
# 'a' - это переменная, которой мы присвоили значение '10'
# в python всё является объектами

print(a)
# так мы можем вывести переменную на печать

# в языке python очень важны отступы, с их помощью интерпретатор понимает
# где находится логическое условие, цикл и другие конструкции, например:

if 3 > 2:
    print("Yes")
# этот код рабочий и интерпретатор его поймёт

# if 3 > 2:
# print(yes)
# этот код интерпретатору не понятен и код не запуститься

# также важен знак ':' в цикла, словиях и т.д.

