"""СТРУКТУРЫ ДАННЫХ"""

# В языке программирования Python существует четыре типа структуры данных:
# Список - это упорядоченное и изменяемое множество. Позволяет дублировать объекты.
# Кортеж - это упорядоченное и неизменяемое множество. Позволяет дублировать объекты.
# Set - это неупорядоченное и неиндексированное множества. Нет повторяющихся объектов.
# Словарь - это сборник, упорядоченный (с версии 3.7) и изменяемый. Нет повторяющихся объектов.

# Упорядоченные наборы данных - это такие наборы, объекты которых находятся в том же порядке,
# в котором они указаны.

